In [1]:
import numpy as np 
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4,np.NaN])

In [3]:
s.isnull()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [4]:
s.notnull()

0     True
1     True
2     True
3     True
4    False
dtype: bool

# Series
## 计算个数

In [5]:
s.value_counts(dropna=False)

NaN    1
4.0    1
3.0    1
2.0    1
1.0    1
dtype: int64

In [6]:
s.count()

4

# DataFrame

In [7]:
df  = pd.DataFrame({'python':np.random.randint(1,101, 7),
                    'Math':np.random.randint(1,101,7),
                    'Englis':np.random.randint(1,101,7),},
                    index=list('ABCDEFG'))
df

   python  Math  Englis
A      46    11      58
B      84    39      35
C      36    54       2
D      77   100      33
E      50    10      36
F      77    97      87
G      46    60      41

## 修改名称

### 修改列索引名称

In [28]:
df2 = df.copy()

In [31]:
df2.rename({'python':'PYTHON'}, axis=1)

   PYTHON  Math  Englis
A      46    11      58
B      84    39      35
C      36    54       2
D      77   100      33
E      50    10      36
F      77    97      87
G      46    60      41

In [32]:
df3 = df2.set_index('python',drop=False)

## 修改索引名称

In [33]:
df3.head()

        python  Math  Englis
python
46          46    11      58
84          84    39      35
36          36    54       2
77          77   100      33
50          50    10      36

In [41]:
df3.index.name = 'index'
df3

       python  Math  Englis
index
46         46    11      58
84         84    39      35
36         36    54       2
77         77   100      33
50         50    10      36
77         77    97      87
46         46    60      41

## 重新设置索引

In [45]:
df3.reset_index(drop=True)

   python  Math  Englis
0      46    11      58
1      84    39      35
2      36    54       2
3      77   100      33
4      50    10      36
5      77    97      87
6      46    60      41

In [42]:
df3.cov()

            python         Math      Englis
python  369.952381   351.166667  208.809524
Math    351.166667  1334.000000  199.000000
Englis  208.809524   199.000000  674.571429

# Pandas对null值的处理

In [50]:
df3 = df2.copy()
df3

   python  Math  Englis
A      46    11      58
B      84    39      35
C      36    54       2
D      77   100      33
E      50    10      36
F      77    97      87
G      46    60      41

In [55]:
df3.loc[0::3,2::2] = np.NaN

In [57]:
df3

   python  Math  Englis
A      46    11     NaN
B      84    39    35.0
C      36    54     2.0
D      77   100     NaN
E      50    10    36.0
F      77    97    87.0
G      46    60     NaN

## 寻找空值

In [69]:
cond = df3.isnull().any(axis=1)
cond

A     True
B    False
C    False
D     True
E    False
F    False
G     True
dtype: bool

In [70]:
df3[cond]

   python  Math  Englis
A      46    11     NaN
D      77   100     NaN
G      46    60     NaN

## 删除空数据

In [72]:
cond = df3.notnull().all(axis=1)
cond

A    False
B     True
C     True
D    False
E     True
F     True
G    False
dtype: bool

In [73]:
# 删除空数据得到非空数据
df3[cond]

   python  Math  Englis
B      84    39    35.0
C      36    54     2.0
E      50    10    36.0
F      77    97    87.0

In [76]:
df3.dropna(axis=0, how='any')

   python  Math  Englis
B      84    39    35.0
C      36    54     2.0
E      50    10    36.0
F      77    97    87.0

In [78]:
df3.drop(labels='Math', axis=1)

   python  Englis
A      46     NaN
B      84    35.0
C      36     2.0
D      77     NaN
E      50    36.0
F      77    87.0
G      46     NaN

In [82]:
df3.drop(labels=['A','C'], axis=0)

   python  Math  Englis
B      84    39    35.0
D      77   100     NaN
E      50    10    36.0
F      77    97    87.0
G      46    60     NaN

In [83]:
df3.fillna(60)

   python  Math  Englis
A      46    11    60.0
B      84    39    35.0
C      36    54     2.0
D      77   100    60.0
E      50    10    36.0
F      77    97    87.0
G      46    60    60.0